app/controllers/notes_controller.rb

  def index
    @note = Note.all
---
SELECT "notes".* FROM "notes"

  def create
    @note = Note.new(note_params)
    if @note.save
---
INSERT INTO "notes" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "Testing note"], ["created_at", "2019-03-18 21:15:13.624770"], ["updated_at", "2019-03-18 21:15:13.624770"]]

  def update
    @note = Note.find(params[:id])
    if @note.update(note_params)
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "text" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["text", "v"], ["updated_at", "2019-03-19 17:01:03.467357"], ["id", 3]]